.cf.xml/InformationRegisters/обм_Приемники_ДанныеЗаполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>обм_Приемники_ДанныеЗаполнения</Name>
			<Comment>Хранит связь между ссылкой приемника и объектом входящего запроса, откуда были взяты данные для заполения приемника</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДанныеЗаполнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.обм_ДанныеЗаполнения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Данные_sha256</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.общ_sha256</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Данные_Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приемник_sha256</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.общ_sha256</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Приемник</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

.cf.xml/Catalogs/обм_ДанныеЗаполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>обм_ДанныеЗаполнения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.обм_ВходящиеСообщения</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_узел</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_категория</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_ид</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные_sha256</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.общ_sha256</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные_Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_Переопределяемый_Обработчики</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеТипаИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приемник</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приемник_JSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приемник_sha256</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.общ_sha256</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

.cf.xml/InformationRegisters/обм_Приемники_ДанныеЗаполнения/Ext/ManagerModule.bsl
Процедура Связать(пСсылкаПриемник, пДанныеЗаполнения) Экспорт  
	
	// Для контекстной подсказки
	Если Ложь Тогда
		пДанныеЗаполнения = Справочники.обм_ДанныеЗаполнения.ПустаяСсылка();
		
	КонецЕсли; 

	Если Не общ.ЭтоЗаполненнаяСсылка(пСсылкаПриемник) Тогда
		Возврат;
		
	КонецЕсли; 
	
	Если Не общ.ЭтоЗаполненнаяСсылка(пДанныеЗаполнения, Тип("СправочникСсылка.обм_ДанныеЗаполнения")) Или Не общ.СсылкаСуществует(пДанныеЗаполнения) Тогда
		Возврат;
		
	КонецЕсли;
	
	// Необходимо вызвать запись объекта Справочник.обм_ДанныеЗаполнения из параметра пДанныеЗаполнения
	// Чтобы в процедуре ПриЗаписи объекта были обновлены реквизиты до консистентного состояния
		данныеЗаполненияОбъект = пДанныеЗаполнения.ПолучитьОбъект();
	    Если ТипЗнч(данныеЗаполненияОбъект) = Тип("СправочникОбъект.обм_ДанныеЗаполнения") И Не ЗначениеЗаполнено(данныеЗаполненияОбъект.Родитель) Тогда 
			данныеЗаполненияОбъект.Приемник = пСсылкаПриемник;
			данныеЗаполненияОбъект.Записать(); 
			
		КонецЕсли;
		данныеЗаполненияОбъект = Неопределено;
		
	// Зафиксировать заполненного приемника в регистре
		// Получить последние данные
		зпрс = Новый Запрос;
		зпрс.УстановитьПараметр("Приемник", пСсылкаПриемник);
		зпрс.Текст = 
		"ВЫБРАТЬ
		|	Т.Приемник КАК Приемник,
		|	Т.ДанныеЗаполнения КАК Данные,
		|	Т.ДатаВремя КАК ДатаВремя,
		|	Т.Данные_sha256 КАК Данные_sha256,
		|	Т.Данные_Длина КАК Данные_Длина,
		|	Т.Приемник_sha256 КАК Приемник_sha256
		|ИЗ
		|	РегистрСведений.обм_Приемники_ДанныеЗаполнения.СрезПоследних(, Приемник = &Приемник) КАК Т";	
		вбрк = зпрс.Выполнить().Выбрать();
		
		данныеЗаполненияИзменены = Истина;  
		Если вбрк.Следующий() Тогда 
			данныеЗаполненияИзменены = 
					вбрк.Данные <> пДанныеЗаполнения
				Или вбрк.ДатаВремя <> пДанныеЗаполнения.ДатаВремя
				Или вбрк.Данные_sha256 <> пДанныеЗаполнения.Данные_sha256
				Или вбрк.Данные_Длина <> пДанныеЗаполнения.Данные_Длина
				Или вбрк.Приемник_sha256 <> пДанныеЗаполнения.Приемник_sha256
				;
			
		КонецЕсли;
		
		Если Не данныеЗаполненияИзменены Тогда
			Возврат;
			
		КонецЕсли;

		мз = РегистрыСведений.обм_Приемники_ДанныеЗаполнения.СоздатьМенеджерЗаписи();
		мз.Период = ТекущаяДата();
		мз.Приемник = пСсылкаПриемник;
		мз.ДанныеЗаполнения = пДанныеЗаполнения;
		мз.ДатаВремя = пДанныеЗаполнения.ДатаВремя;
		мз.Данные_sha256 = пДанныеЗаполнения.Данные_sha256;
		мз.Данные_Длина = пДанныеЗаполнения.Данные_Длина; 
		мз.Приемник_sha256 = пДанныеЗаполнения.Приемник_sha256;
		мз.Записать(); 
	
КонецПроцедуры
